{
  "vocab_size": 260,
  "special_tokens": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<START>": 2,
    "<END>": 3
  },
  "max_char_code": 255,
  "char2id": {
    "\u0000": 4,
    "\u0001": 5,
    "\u0002": 6,
    "\u0003": 7,
    "\u0004": 8,
    "\u0005": 9,
    "\u0006": 10,
    "\u0007": 11,
    "\b": 12,
    "\t": 13,
    "\n": 14,
    "\u000b": 15,
    "\f": 16,
    "\r": 17,
    "\u000e": 18,
    "\u000f": 19,
    "\u0010": 20,
    "\u0011": 21,
    "\u0012": 22,
    "\u0013": 23,
    "\u0014": 24,
    "\u0015": 25,
    "\u0016": 26,
    "\u0017": 27,
    "\u0018": 28,
    "\u0019": 29,
    "\u001a": 30,
    "\u001b": 31,
    "\u001c": 32,
    "\u001d": 33,
    "\u001e": 34,
    "\u001f": 35,
    " ": 36,
    "!": 37,
    "\"": 38,
    "#": 39,
    "$": 40,
    "%": 41,
    "&": 42,
    "'": 43,
    "(": 44,
    ")": 45,
    "*": 46,
    "+": 47,
    ",": 48,
    "-": 49,
    ".": 50,
    "/": 51,
    "0": 52,
    "1": 53,
    "2": 54,
    "3": 55,
    "4": 56,
    "5": 57,
    "6": 58,
    "7": 59,
    "8": 60,
    "9": 61,
    ":": 62,
    ";": 63,
    "<": 64,
    "=": 65,
    ">": 66,
    "?": 67,
    "@": 68,
    "A": 69,
    "B": 70,
    "C": 71,
    "D": 72,
    "E": 73,
    "F": 74,
    "G": 75,
    "H": 76,
    "I": 77,
    "J": 78,
    "K": 79,
    "L": 80,
    "M": 81,
    "N": 82,
    "O": 83,
    "P": 84,
    "Q": 85,
    "R": 86,
    "S": 87,
    "T": 88,
    "U": 89,
    "V": 90,
    "W": 91,
    "X": 92,
    "Y": 93,
    "Z": 94,
    "[": 95,
    "\\": 96,
    "]": 97,
    "^": 98,
    "_": 99,
    "`": 100,
    "a": 101,
    "b": 102,
    "c": 103,
    "d": 104,
    "e": 105,
    "f": 106,
    "g": 107,
    "h": 108,
    "i": 109,
    "j": 110,
    "k": 111,
    "l": 112,
    "m": 113,
    "n": 114,
    "o": 115,
    "p": 116,
    "q": 117,
    "r": 118,
    "s": 119,
    "t": 120,
    "u": 121,
    "v": 122,
    "w": 123,
    "x": 124,
    "y": 125,
    "z": 126,
    "{": 127,
    "|": 128,
    "}": 129,
    "~": 130,
    "": 131,
    "": 132,
    "": 133,
    "": 134,
    "": 135,
    "": 136,
    "": 137,
    "": 138,
    "": 139,
    "": 140,
    "": 141,
    "": 142,
    "": 143,
    "": 144,
    "": 145,
    "": 146,
    "": 147,
    "": 148,
    "": 149,
    "": 150,
    "": 151,
    "": 152,
    "": 153,
    "": 154,
    "": 155,
    "": 156,
    "": 157,
    "": 158,
    "": 159,
    "": 160,
    "": 161,
    "": 162,
    "": 163,
    " ": 164,
    "¡": 165,
    "¢": 166,
    "£": 167,
    "¤": 168,
    "¥": 169,
    "¦": 170,
    "§": 171,
    "¨": 172,
    "©": 173,
    "ª": 174,
    "«": 175,
    "¬": 176,
    "­": 177,
    "®": 178,
    "¯": 179,
    "°": 180,
    "±": 181,
    "²": 182,
    "³": 183,
    "´": 184,
    "µ": 185,
    "¶": 186,
    "·": 187,
    "¸": 188,
    "¹": 189,
    "º": 190,
    "»": 191,
    "¼": 192,
    "½": 193,
    "¾": 194,
    "¿": 195,
    "À": 196,
    "Á": 197,
    "Â": 198,
    "Ã": 199,
    "Ä": 200,
    "Å": 201,
    "Æ": 202,
    "Ç": 203,
    "È": 204,
    "É": 205,
    "Ê": 206,
    "Ë": 207,
    "Ì": 208,
    "Í": 209,
    "Î": 210,
    "Ï": 211,
    "Ð": 212,
    "Ñ": 213,
    "Ò": 214,
    "Ó": 215,
    "Ô": 216,
    "Õ": 217,
    "Ö": 218,
    "×": 219,
    "Ø": 220,
    "Ù": 221,
    "Ú": 222,
    "Û": 223,
    "Ü": 224,
    "Ý": 225,
    "Þ": 226,
    "ß": 227,
    "à": 228,
    "á": 229,
    "â": 230,
    "ã": 231,
    "ä": 232,
    "å": 233,
    "æ": 234,
    "ç": 235,
    "è": 236,
    "é": 237,
    "ê": 238,
    "ë": 239,
    "ì": 240,
    "í": 241,
    "î": 242,
    "ï": 243,
    "ð": 244,
    "ñ": 245,
    "ò": 246,
    "ó": 247,
    "ô": 248,
    "õ": 249,
    "ö": 250,
    "÷": 251,
    "ø": 252,
    "ù": 253,
    "ú": 254,
    "û": 255,
    "ü": 256,
    "ý": 257,
    "þ": 258,
    "ÿ": 259
  },
  "config": {
    "max_sequence_length": 1024,
    "truncation": "right",
    "padding": "left",
    "padding_token_id": 0,
    "unknown_token_id": 1,
    "noise_injection": {
      "enabled": true,
      "dropout_rate": 0.1,
      "training_only": true,
      "deterministic_seed": true
    }
  },
  "version": "v1.0",
  "creation_date": "2025-10-22"
}